app/controllers/journal_entries_controller.rb

   def index
   	@place = Place.find(params[:place_id])
    @journal_entries = @place.journal_entries.all
---
SELECT "places".* FROM "places" WHERE "places"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "journal_entries".* FROM "journal_entries" WHERE "journal_entries"."place_id" = 1

  def new
  	@trip = Trip.find(params[:trip_id])
  	@place = @trip.places.find(params[:place_id])
---
SELECT "places".* FROM "places" WHERE "places"."id" = ? LIMIT 1  [["id", "1"]]