app/controllers/map_controller.rb

	def show
		@trip = Trip.find(params[:id])

		@place = Trip.find(params[:id]).places
---
SELECT "trips".* FROM "trips" WHERE "trips"."id" = ? LIMIT 1  [["id", "11"]]
SELECT "places".* FROM "places" WHERE "places"."trip_id" = 11