app/controllers/places_controller.rb

SELECT "places".* FROM "places" WHERE "places"."trip_id" = 10
SELECT "trips".* FROM "trips" WHERE "trips"."id" = ? LIMIT 1  [["id", "10"]]
---
	def index
	  @places = Trip.find(params[:trip_id]).places

SELECT "trips".* FROM "trips" WHERE "trips"."id" = ? LIMIT 1  [["id", "25"]]
---
	def new
		@trip = Trip.find(params[:trip_id])

SELECT "trips".* FROM "trips" WHERE "trips"."id" = ? LIMIT 1  [["id", "25"]]
INSERT INTO "places" ("created_at", "end_date", "latitude", "longitude", "place", "start_date", "trip_id", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
	def create
		@trip = Trip.find(params[:trip_id])
		@place = @trip.places.create(params[:place])

SELECT "places".* FROM "places" WHERE "places"."id" = ? LIMIT 1  [["id", "12"]]
SELECT "places".* FROM "places"
---
	def show
		@trip = Trip.find(params[:trip_id])
		@place = Place.find(params[:id])
		@places = Place.all