app/controllers/trips_controller.rb

  def create
     @trip = Trip.new(params[:trip])
     @trip.save
---
INSERT INTO "trips" ("created_at", "end_date", "name", "start_date", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Wed, 05 Jun 2013 14:23:19 UTC +00:00], ["end_date", Wed, 05 Jun 2013], ["name", ""], ["start_date", Wed, 05 Jun 2013], ["updated_at", Wed, 05 Jun 2013 14:23:19 UTC +00:00]]

  def show
    @trip = Trip.find(params[:id])
    @trips = Trip.all
---
SELECT "trips".* FROM "trips" WHERE "trips"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "trips".* FROM "trips"