app/views/places/new.html.erb

SELECT "places".* FROM "places" WHERE "places"."trip_id" = 58
---
        <%= form_for([@trip, @trip.places.build]) do |form| %>
        <%= collection_select(:place, :previous_place_id, @trip.places.all, :id, :place) %>